<template>
  <div>
    <p>
      נעים מאוד להכיר, שמי סטפני נשואה לעומרי ואמא ל-2 ילדים מתוקים, אמילי ויונתן.
      <br>
      הילדים שלי הם אלו שהובילו אותי להבנה ש-״אמא מאושרת היא אמא שטוב לה״.
<br>
      במהלך חופשת הלידה שלי החלטתי שהדבר הנכון לי יהיה לעזוב את מקום העבודה שלי בחברת הייטק ולצאת אל דרך חדשה, עצמאית ומשמעותית עם המון מוטיבציה בידיעה שאני הולכת לעזור להורים, תינוקות וילדים. לכל אחד מהם בדרכם: ברגע שהפכתי לאמא הבנתי כמה הורות היא אתגר גדול והיא למעשה התפקיד הכי משמעותי עבורי, ולאחר קריאה מרובה בנושא החלטתי  להתמקצע  על מנת שאוכל לגרום למשפחות נוספות להיות מאושרות.
<br>
      אתם כבר כאן וזה הצעד הראשון בדרך להפיכת המשפחה שלכם למאושרת יותר.
      <br><br>
      ״בואו לחוות את ההורות שלכם מחדש יחד איתי״
    </p>
  </div>
</template>

<script>
export default {
  name: "FirstParagraph"
}
</script>

<style scoped>
  div {
    font-family: drakonit, serif;
    font-size: 1.7em;
    line-height: 1.5em;
    max-width: 80%;
    text-align: center;
    justify-content: center;
    position: relative;
    margin-left: auto;
    margin-right: auto;
 }
</style>